zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K324_DCM_GPR.h
#define DCM_GPR_DCMRWD8_LPSPI3_DBG_DIS_CM7_1_MASK (0x40000U)
#define DCM_GPR_DCMRWD8_LPSPI3_DBG_DIS_CM7_1_SHIFT (18U)
#define DCM_GPR_DCMRWD8_LPSPI3_DBG_DIS_CM7_1_WIDTH (1U)
#define DCM_GPR_DCMRWD8_LPSPI3_DBG_DIS_CM7_1(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD8_LPSPI3_DBG_DIS_CM7_1_SHIFT)) & DCM_GPR_DCMRWD8_LPSPI3_DBG_DIS_CM7_1_MASK)

#define DCM_GPR_DCMRWD8_LPSPI4_DBG_DIS_CM7_1_MASK (0x80000U)
#define DCM_GPR_DCMRWD8_LPSPI4_DBG_DIS_CM7_1_SHIFT (19U)
#define DCM_GPR_DCMRWD8_LPSPI4_DBG_DIS_CM7_1_WIDTH (1U)
#define DCM_GPR_DCMRWD8_LPSPI4_DBG_DIS_CM7_1(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD8_LPSPI4_DBG_DIS_CM7_1_SHIFT)) & DCM_GPR_DCMRWD8_LPSPI4_DBG_DIS_CM7_1_MASK)

#define DCM_GPR_DCMRWD8_LPSPI5_DBG_DIS_CM7_1_MASK (0x100000U)
#define DCM_GPR_DCMRWD8_LPSPI5_DBG_DIS_CM7_1_SHIFT (20U)
#define DCM_GPR_DCMRWD8_LPSPI5_DBG_DIS_CM7_1_WIDTH (1U)
#define DCM_GPR_DCMRWD8_LPSPI5_DBG_DIS_CM7_1(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD8_LPSPI5_DBG_DIS_CM7_1_SHIFT)) & DCM_GPR_DCMRWD8_LPSPI5_DBG_DIS_CM7_1_MASK)

#define DCM_GPR_DCMRWD8_LPI2C0_DBG_DIS_CM7_1_MASK (0x200000U)
#define DCM_GPR_DCMRWD8_LPI2C0_DBG_DIS_CM7_1_SHIFT (21U)
#define DCM_GPR_DCMRWD8_LPI2C0_DBG_DIS_CM7_1_WIDTH (1U)
#define DCM_GPR_DCMRWD8_LPI2C0_DBG_DIS_CM7_1(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD8_LPI2C0_DBG_DIS_CM7_1_SHIFT)) & DCM_GPR_DCMRWD8_LPI2C0_DBG_DIS_CM7_1_MASK)

#define DCM_GPR_DCMRWD8_LPI2C1_DBG_DIS_CM7_1_MASK (0x400000U)
#define DCM_GPR_DCMRWD8_LPI2C1_DBG_DIS_CM7_1_SHIFT (22U)
#define DCM_GPR_DCMRWD8_LPI2C1_DBG_DIS_CM7_1_WIDTH (1U)
#define DCM_GPR_DCMRWD8_LPI2C1_DBG_DIS_CM7_1(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD8_LPI2C1_DBG_DIS_CM7_1_SHIFT)) & DCM_GPR_DCMRWD8_LPI2C1_DBG_DIS_CM7_1_MASK)

#define DCM_GPR_DCMRWD8_FLEXIO_DBG_DIS_CM7_1_MASK (0x800000U)
#define DCM_GPR_DCMRWD8_FLEXIO_DBG_DIS_CM7_1_SHIFT (23U)
#define DCM_GPR_DCMRWD8_FLEXIO_DBG_DIS_CM7_1_WIDTH (1U)
#define DCM_GPR_DCMRWD8_FLEXIO_DBG_DIS_CM7_1(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD8_FLEXIO_DBG_DIS_CM7_1_SHIFT)) & DCM_GPR_DCMRWD8_FLEXIO_DBG_DIS_CM7_1_MASK)

#define DCM_GPR_DCMRWD8_FLEXCAN0_DBG_DIS_CM7_1_MASK (0x1000000U)
#define DCM_GPR_DCMRWD8_FLEXCAN0_DBG_DIS_CM7_1_SHIFT (24U)
#define DCM_GPR_DCMRWD8_FLEXCAN0_DBG_DIS_CM7_1_WIDTH (1U)
#define DCM_GPR_DCMRWD8_FLEXCAN0_DBG_DIS_CM7_1(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD8_FLEXCAN0_DBG_DIS_CM7_1_SHIFT)) & DCM_GPR_DCMRWD8_FLEXCAN0_DBG_DIS_CM7_1_MASK)

#define DCM_GPR_DCMRWD8_FLEXCAN1_DBG_DIS_CM7_1_MASK (0x2000000U)
#define DCM_GPR_DCMRWD8_FLEXCAN1_DBG_DIS_CM7_1_SHIFT (25U)
#define DCM_GPR_DCMRWD8_FLEXCAN1_DBG_DIS_CM7_1_WIDTH (1U)
#define DCM_GPR_DCMRWD8_FLEXCAN1_DBG_DIS_CM7_1(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD8_FLEXCAN1_DBG_DIS_CM7_1_SHIFT)) & DCM_GPR_DCMRWD8_FLEXCAN1_DBG_DIS_CM7_1_MASK)

#define DCM_GPR_DCMRWD8_FLEXCAN2_DBG_DIS_CM7_1_MASK (0x4000000U)
#define DCM_GPR_DCMRWD8_FLEXCAN2_DBG_DIS_CM7_1_SHIFT (26U)
#define DCM_GPR_DCMRWD8_FLEXCAN2_DBG_DIS_CM7_1_WIDTH (1U)
#define DCM_GPR_DCMRWD8_FLEXCAN2_DBG_DIS_CM7_1(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD8_FLEXCAN2_DBG_DIS_CM7_1_SHIFT)) & DCM_GPR_DCMRWD8_FLEXCAN2_DBG_DIS_CM7_1_MASK)

#define DCM_GPR_DCMRWD8_FLEXCAN3_DBG_DIS_CM7_1_MASK (0x8000000U)
#define DCM_GPR_DCMRWD8_FLEXCAN3_DBG_DIS_CM7_1_SHIFT (27U)
#define DCM_GPR_DCMRWD8_FLEXCAN3_DBG_DIS_CM7_1_WIDTH (1U)
#define DCM_GPR_DCMRWD8_FLEXCAN3_DBG_DIS_CM7_1(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD8_FLEXCAN3_DBG_DIS_CM7_1_SHIFT)) & DCM_GPR_DCMRWD8_FLEXCAN3_DBG_DIS_CM7_1_MASK)

#define DCM_GPR_DCMRWD8_FLEXCAN4_DBG_DIS_CM7_1_MASK (0x10000000U)
#define DCM_GPR_DCMRWD8_FLEXCAN4_DBG_DIS_CM7_1_SHIFT (28U)
#define DCM_GPR_DCMRWD8_FLEXCAN4_DBG_DIS_CM7_1_WIDTH (1U)
#define DCM_GPR_DCMRWD8_FLEXCAN4_DBG_DIS_CM7_1(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD8_FLEXCAN4_DBG_DIS_CM7_1_SHIFT)) & DCM_GPR_DCMRWD8_FLEXCAN4_DBG_DIS_CM7_1_MASK)

#define DCM_GPR_DCMRWD8_FLEXCAN5_DBG_DIS_CM7_1_MASK (0x20000000U)
#define DCM_GPR_DCMRWD8_FLEXCAN5_DBG_DIS_CM7_1_SHIFT (29U)
#define DCM_GPR_DCMRWD8_FLEXCAN5_DBG_DIS_CM7_1_WIDTH (1U)
#define DCM_GPR_DCMRWD8_FLEXCAN5_DBG_DIS_CM7_1(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD8_FLEXCAN5_DBG_DIS_CM7_1_SHIFT)) & DCM_GPR_DCMRWD8_FLEXCAN5_DBG_DIS_CM7_1_MASK)

#define DCM_GPR_DCMRWD8_SAI0_DBG_DIS_CM7_1_MASK  (0x40000000U)
#define DCM_GPR_DCMRWD8_SAI0_DBG_DIS_CM7_1_SHIFT (30U)
#define DCM_GPR_DCMRWD8_SAI0_DBG_DIS_CM7_1_WIDTH (1U)
#define DCM_GPR_DCMRWD8_SAI0_DBG_DIS_CM7_1(x)    (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD8_SAI0_DBG_DIS_CM7_1_SHIFT)) & DCM_GPR_DCMRWD8_SAI0_DBG_DIS_CM7_1_MASK)

#define DCM_GPR_DCMRWD8_SAI1_DBG_DIS_CM7_1_MASK  (0x80000000U)
#define DCM_GPR_DCMRWD8_SAI1_DBG_DIS_CM7_1_SHIFT (31U)
#define DCM_GPR_DCMRWD8_SAI1_DBG_DIS_CM7_1_WIDTH (1U)
#define DCM_GPR_DCMRWD8_SAI1_DBG_DIS_CM7_1(x)    (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD8_SAI1_DBG_DIS_CM7_1_SHIFT)) & DCM_GPR_DCMRWD8_SAI1_DBG_DIS_CM7_1_MASK)
/*! @} */

/*! @name DCMRWF1 - Read Write GPR On Functional Reset Register */
/*! @{ */

#define DCM_GPR_DCMRWF1_CAN_TIMESTAMP_SEL_MASK   (0x1U)
#define DCM_GPR_DCMRWF1_CAN_TIMESTAMP_SEL_SHIFT  (0U)
#define DCM_GPR_DCMRWF1_CAN_TIMESTAMP_SEL_WIDTH  (1U)
#define DCM_GPR_DCMRWF1_CAN_TIMESTAMP_SEL(x)     (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF1_CAN_TIMESTAMP_SEL_SHIFT)) & DCM_GPR_DCMRWF1_CAN_TIMESTAMP_SEL_MASK)

#define DCM_GPR_DCMRWF1_CAN_TIMESTAMP_EN_MASK    (0x2U)
#define DCM_GPR_DCMRWF1_CAN_TIMESTAMP_EN_SHIFT   (1U)
#define DCM_GPR_DCMRWF1_CAN_TIMESTAMP_EN_WIDTH   (1U)
#define DCM_GPR_DCMRWF1_CAN_TIMESTAMP_EN(x)      (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF1_CAN_TIMESTAMP_EN_SHIFT)) & DCM_GPR_DCMRWF1_CAN_TIMESTAMP_EN_MASK)

#define DCM_GPR_DCMRWF1_FCCU_SW_NCF0_MASK        (0x4U)
#define DCM_GPR_DCMRWF1_FCCU_SW_NCF0_SHIFT       (2U)
#define DCM_GPR_DCMRWF1_FCCU_SW_NCF0_WIDTH       (1U)
#define DCM_GPR_DCMRWF1_FCCU_SW_NCF0(x)          (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF1_FCCU_SW_NCF0_SHIFT)) & DCM_GPR_DCMRWF1_FCCU_SW_NCF0_MASK)

#define DCM_GPR_DCMRWF1_FCCU_SW_NCF1_MASK        (0x8U)
#define DCM_GPR_DCMRWF1_FCCU_SW_NCF1_SHIFT       (3U)
#define DCM_GPR_DCMRWF1_FCCU_SW_NCF1_WIDTH       (1U)
#define DCM_GPR_DCMRWF1_FCCU_SW_NCF1(x)          (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF1_FCCU_SW_NCF1_SHIFT)) & DCM_GPR_DCMRWF1_FCCU_SW_NCF1_MASK)

#define DCM_GPR_DCMRWF1_FCCU_SW_NCF2_MASK        (0x10U)
#define DCM_GPR_DCMRWF1_FCCU_SW_NCF2_SHIFT       (4U)
#define DCM_GPR_DCMRWF1_FCCU_SW_NCF2_WIDTH       (1U)
#define DCM_GPR_DCMRWF1_FCCU_SW_NCF2(x)          (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF1_FCCU_SW_NCF2_SHIFT)) & DCM_GPR_DCMRWF1_FCCU_SW_NCF2_MASK)

#define DCM_GPR_DCMRWF1_FCCU_SW_NCF3_MASK        (0x20U)
#define DCM_GPR_DCMRWF1_FCCU_SW_NCF3_SHIFT       (5U)
#define DCM_GPR_DCMRWF1_FCCU_SW_NCF3_WIDTH       (1U)
#define DCM_GPR_DCMRWF1_FCCU_SW_NCF3(x)          (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF1_FCCU_SW_NCF3_SHIFT)) & DCM_GPR_DCMRWF1_FCCU_SW_NCF3_MASK)

#define DCM_GPR_DCMRWF1_EMAC_CONF_SEL_MASK       (0xC0U)
#define DCM_GPR_DCMRWF1_EMAC_CONF_SEL_SHIFT      (6U)
#define DCM_GPR_DCMRWF1_EMAC_CONF_SEL_WIDTH      (2U)
#define DCM_GPR_DCMRWF1_EMAC_CONF_SEL(x)         (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF1_EMAC_CONF_SEL_SHIFT)) & DCM_GPR_DCMRWF1_EMAC_CONF_SEL_MASK)

#define DCM_GPR_DCMRWF1_VDD_HV_B_IO_CTRL_LATCH_MASK (0x8000U)
#define DCM_GPR_DCMRWF1_VDD_HV_B_IO_CTRL_LATCH_SHIFT (15U)
#define DCM_GPR_DCMRWF1_VDD_HV_B_IO_CTRL_LATCH_WIDTH (1U)
#define DCM_GPR_DCMRWF1_VDD_HV_B_IO_CTRL_LATCH(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF1_VDD_HV_B_IO_CTRL_LATCH_SHIFT)) & DCM_GPR_DCMRWF1_VDD_HV_B_IO_CTRL_LATCH_MASK)

