zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K324_DCM_GPR.h
#define DCM_GPR_DCMROPP3_POR_WDG_STAT90_MASK     (0x4000000U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT90_SHIFT    (26U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT90_WIDTH    (1U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT90(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP3_POR_WDG_STAT90_SHIFT)) & DCM_GPR_DCMROPP3_POR_WDG_STAT90_MASK)

#define DCM_GPR_DCMROPP3_POR_WDG_STAT91_MASK     (0x8000000U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT91_SHIFT    (27U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT91_WIDTH    (1U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT91(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP3_POR_WDG_STAT91_SHIFT)) & DCM_GPR_DCMROPP3_POR_WDG_STAT91_MASK)

#define DCM_GPR_DCMROPP3_POR_WDG_STAT92_MASK     (0x10000000U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT92_SHIFT    (28U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT92_WIDTH    (1U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT92(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP3_POR_WDG_STAT92_SHIFT)) & DCM_GPR_DCMROPP3_POR_WDG_STAT92_MASK)

#define DCM_GPR_DCMROPP3_POR_WDG_STAT93_MASK     (0x20000000U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT93_SHIFT    (29U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT93_WIDTH    (1U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT93(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP3_POR_WDG_STAT93_SHIFT)) & DCM_GPR_DCMROPP3_POR_WDG_STAT93_MASK)

#define DCM_GPR_DCMROPP3_POR_WDG_STAT94_MASK     (0x40000000U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT94_SHIFT    (30U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT94_WIDTH    (1U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT94(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP3_POR_WDG_STAT94_SHIFT)) & DCM_GPR_DCMROPP3_POR_WDG_STAT94_MASK)

#define DCM_GPR_DCMROPP3_POR_WDG_STAT95_MASK     (0x80000000U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT95_SHIFT    (31U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT95_WIDTH    (1U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT95(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP3_POR_WDG_STAT95_SHIFT)) & DCM_GPR_DCMROPP3_POR_WDG_STAT95_MASK)
/*! @} */

/*! @name DCMROPP4 - Read Only GPR On PMCPOR Reset */
/*! @{ */

#define DCM_GPR_DCMROPP4_POR_WDG_STAT96_MASK     (0x1U)
#define DCM_GPR_DCMROPP4_POR_WDG_STAT96_SHIFT    (0U)
#define DCM_GPR_DCMROPP4_POR_WDG_STAT96_WIDTH    (1U)
#define DCM_GPR_DCMROPP4_POR_WDG_STAT96(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP4_POR_WDG_STAT96_SHIFT)) & DCM_GPR_DCMROPP4_POR_WDG_STAT96_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group DCM_GPR_Register_Masks */

/*!
 * @}
 */ /* end of group DCM_GPR_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K324_DCM_GPR_H_) */
